{
	"count": 2,
	"items": [
		{
			"id": 1,
			"title": "Getting Started",
			"url": "#getting-started",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>Before starting to design our dream visual, lets start with installing PureViz Infographic custom visual from App Source. We can download the visual from <a target='_blank' href='https://appsource.microsoft.com/en-us/marketplace/apps?product=power-bi-visuals'>App Source</a> or direcly insert from Power BI Desktop. <img src='/infographic/docs/gettingstarted.gif'/> Then, we can drag and drop any related measures or columns to data field area of our visual so we can start design process.</p> <p>To design our visual, we have two options here: Loading our own design (Designed in Microsoft Power Point or other SVG tools) or Chosing a Sample from Gallery. You can watch following video to learn basics about the visual or navigate to next topic to learn more on how to create our dream design. </p><iframe width='100%' height='400' src='https://www.youtube.com/embed/3J4cA_6f4Z4' frameborder='0' allow='accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture' allowfullscreen></iframe><p>If you want to see sample report in action before going forward, <a href='https://app.powerbi.com/view?r=eyJrIjoiZjAwMGQzMjgtMGU3NS00NWRhLWJmNDctZTI3YTQ2MGJkNjQ0IiwidCI6IjRjODBkN2NmLWI3ZmYtNGM2Yy1hNjc4LWIxNmFkYWQxNzFjYiIsImMiOjl9&pageName=ReportSection606a857d73e77b8b6a97'>click here.</a> </p>"
		},
		{
			"id": 2,
			"title": "Import from Power Point",
			"url": "#import-from-power-point",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>PureViz Infographic custom visual gives us ability to design our dream visual in any tool feel comfortable, including Microsoft Power Point. Our design can include shapes, icons, text boxes and images. Select our drawings, right-click and click save as picture to export our design. Chose .svg format in save as dialog and our visual is almost ready! <br> <img src='/infographic/docs/pptxexport.png'/><div class='tip'>Pro Tip: Power Point converts shadow, glow or similar effects to pictures while exporting to svg and it can limit our edit capabilities in PureViz designer. We strongly recommend adding this effects to only static parts of our design.</div> Then we can open Power BI and import our svg file using 'Upload your own design' button in the visual. <img src='/infographic/docs/uploadsvg.png'> After successful loading we will see all layers of our design in right panel.<img src='/infographic/docs/layers.png'> Please click next button to learn about option 2: Pick a design from sample gallery. </p>"
		},
		{
			"id": 3,
			"title": "Import from Sample Gallery",
			"url": "#import-from-gallery",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>In order to showcase what is possible with PureViz Infographic, tens of sample visuals are published on <a href='/infographic-gallery'>Sample Infographic Gallery</a> for free. You can download these visuals directly from web page or you can also access these samples directly from the visual. If you want to edit these sample visuals before using, you can find all sample designs in <a href='/infographic-gallery'>this Power Point Presentation.</a><img src='/infographic/docs/galleryitems.png'/> Navitage to Sample Gallery button in the visual and select any design to load. If you have any existing design and configurations, all will be updated with new design. <img src='/infographic/docs/galleryimport.png'/> After a successfull load, you should see layers of your visual on the right panel as below.<img src='/infographic/docs/layers.png'/> Now, we are ready for formatting & data binding!</p>"
		},
		{
			"id": 4,
			"title": "Simple Formatting",
			"url": "#simple-formatting",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>We can select layers from right panel (list) or directly hovering & clicking shapes from canvas on the left. All layers are listed in right panel at layer's hierarchy order. <img src='/infographic/docs/layers.png'/> When you click on any layer, based on layer type, all editable properties of layer will be listed in format pane. You can set Fill Color, Border Width, Visibility, Size, Position and more… in pane.<img src='/infographic/docs/simplegradient.png'/> In this example, we selected fill color of shape as gradient fill, and set stop colors & positions as we wish.</p> <p>In next section, we will set any attirubte of any layer to a data field, instead of static values.</p>"
		},
		{
			"id": 5,
			"title": "Simple Data Binding",
			"url": "#simple-data-binding",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>In next example, here we set text label value to a static value of “Special Name” first. <img src='/infographic/docs/statictext.png'/></p><p>Now, let’s look at magic behind fx button at right of text box. We can click on fx button to bind any property of any layer to dynamic values coming from data.<img src='/infographic/docs/dynamicformula.png'/> Here we set text value as our measure [First Segment]. We can also add static Prefix or Suffix here easily.</p>"
		},
		{
			"id": 6,
			"title": "Switch to Preview Mode",
			"url": "#previewmode",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>Your first simple visual is ready to be consumed by end users! Click yellow preview button on right top corner and preview your visual to check how it looks like for your end users. <img src='/infographic/docs/previewmode.gif'/> And get ready to enjoy reduced design time, smaller report size and boosted query performance thanks to all-in-one single visual.</p>"
		},
		{
			"id": 7,
			"title": "Doing Math & Number Formatting",
			"url": "#math-number-formatting",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>If our data is numeric, we can also set number format of output text, add prefix/suffix. We can even do simple math here without having to write new measure and without sending extra queries to your data model! <img src='/infographic/docs/numberformat.gif'/> In this example, we divided [Efficiency] measure by 10 and applied number formatting with one decimal digits and set comma as thousand seperator. We also set $ sign as prefix and K as suffix. </p>"
		},
		{
			"id": 8,
			"title": "Conditional Values - If/Else",
			"url": "#conditional-fx",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>When we need to change value of a text label, color or any other property <b>based on another data field</b>, we can switch to If/Else tab of custom value dialog to make any property value conditional. As below screenshot, comparison can also include math equations. <img src='/infographic/docs/ifelse.png'/> In this example, we check [Discounts] measure value and compared it with  0.2*[Sales], then set color of bar based on bigger value. Output color is green since currently condition returns false. It will change dynamically based on filters & updated data.  </p>"
		},
		{
			"id": 9,
			"title": "Transform Animations",
			"url": "#shape-animations",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>Instead of binding a property to single value, we can create cool animations by transitioning between two values in defined interval. This functionality also allows us to create entrance and exit animations for each layer in our visual using opacity, scale and position animations. <br> To create a animation, open animations tab in formatting pane, select any transformation and set parameters with static or dynamic values. Animations will be triggered on each data update. </p> <img src='/infographic/docs/simplerotate.png'/>  In this example we are applying rotate animation for wind turbine shape, its duration for one cycle is 1 seconds, and it repeats forever. Output is similar to below.  <img src='/infographic/docs/animationrotate.gif'/> It is also possible to apply color animation on any shape or text layer. In below example we are appliyng color switch animation on KPI background, based on data field.  <img src='/infographic/docs/animatecolor.gif'/> In next section we will learn how to apply typing & counting animations on text labels. "
		},
		{
			"id": 10,
			"title": "Text Animations",
			"url": "#text-animations",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>We can apply count up/down animation on any number field. Start value, duration, or prefix can be dynamic data fields as well. In below example we are applying counting animation on text label up to 99 (it can be dynamic) in 1 second duration.  <img src='/infographic/docs/updowncount.gif'/> This counting can be up or down direction starting from any value. We can also set unit or other prefixes easily.<br> In next example we will apply text typing animation on a text field. Select typing animation from animation tab and output is similar to this:  <img src='/infographic/docs/typingani.gif'/> </p>"
		},
		{
			"id": 11,
			"title": "Advanced Color Fill",
			"url": "#advanced-fill",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>We can create custom gradient for any shape using color format. When we need directional color fill for any shape, special shape fill option gives us couple of options to create creative infographics. An example color fill is given below.  <img src='/infographic/docs/specialshapefill.gif'/> Currently possible linear fill directions are below: <br> -> Left to Right<br> -> Right to Left<br> -> Top to Bottom<br> -> Bottom to Top</p>In addition to lineer directions, You may fill a half circle or half donut shape with a color from one angle to another. Possible arc angle spans are below.  <img style='width: 60%' src='/infographic/docs/arcfill.png'/> "
		},
		{
			"id": 12,
			"title": "Category Support & Selections 🆕",
			"url": "#category-support-selections",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>With March 2022 update, Pureviz Infographic now supports category data fields. We can now feed our visual with multi-row data including categories(on rows) and measures. </p><p>We can assign a text layer value to specific row in your data table using formula similar to <b>[Actual?Location=Asia]*100</b>. This formula first finds the first row with 'Asia' value in Location column, and then returns related Actual value multiplied with 100. <img src='/infographic/docs/rowselections.png'/></p><p>Alternatively, you can assign bind any layer to a row in dataset using Category/Row Binding option (eg. [rownum?Location=Europe]). In this case, not only labels are calculated automatically using this row context, but it also enables <b>on-click selections from layers</b>. If you click on a layer with row binding, it will filter other visuals based on selection and also accepts filtering from other visuals.</p><img src='/infographic/docs/selection3.png'/> </p><p>You can test our sample report including this feature in action <a target='blank' href='https://pureviz.net/infographic-sample-report'> here.</a></p>"
		},	
		{
			"id": 14,
			"title": "Row Aggregations 🆕",
			"url": "#row-aggregations",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>When we feed our visual with multi-row data including categories, we can also make aggregations for specific measures using '[fieldname::agg]' syntax. If we want to show sum of a measure for all rows given, we can write <b>[New Customers::sum]</b> Possible values for aggreations are <b>first, last, sum, avg, max, min and count</b>.<img src='/infographic/docs/rowaggssum.png'/></p><p>Default aggregation for all measures is first and a measure formula will return first row value if ::agg parameter is not given.<img src='/infographic/docs/aggs.png'/> </p><p>Additionaly you can obtain value from specific row using giving integer numbers as agg parameter. Eg. [City::3] formula will return City value for 3rd row in given dataset. </p><p>You can test our sample report including this feature in action <a target='blank' href='https://pureviz.net/infographic-sample-report'> here.</a></p>"
		},	
		{
			"id": 15,
			"title": "Repeating Paterns & Duplicates 🆕",
			"url": "#repeating-patterns-duplicates",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>Using <b>duplicate layer per row</b> feature in edit pane, we can duplicate any layer by number of rows, and then shift them vertically as needed. <img src='/infographic/docs/duplicates.png'/> Then using <b>'dynamic canvas size'</b> option available in settings panel of the visual, we can set canvas height to be '[rownum::max]*240'. So it will be dynamically resized based on given rows. Scroll bar will be added automatically when design is not fit in visual canvas.<img src='/infographic/docs/dynamicheight.png'/></p><p>To format shapes or to change text labels, we don't need to write any formula for row binding. <b>All measures are automatically calculated from related row for each duplicate.</b></p><p>Additionaly we can obtain custom table design using two visuals together, one header visual and the other visual including duplicates. He is sample output you can obtain using this scenario.<img src='/infographic/docs/table.png'/> </p><p>You can test our sample report including this feature in action <a target='blank' href='https://pureviz.net/infographic-sample-report'> here.</a></p>"
		    
		},	
		{
			"id": 16,
			"title": "Bookmarks & Drill-through Support 🆕",
			"url": "#bookmarks-drillthrough-support",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>With this new version, we also added Bookmark and Drill-through support to the PureViz Infographic!</p> <p>If your visual is including at least one category field, you can capture selections in the visual using bookmarks or  <b>drill-through to another page using row selections</b>.<img src='/infographic/docs/bookmarks.png'/> </p><p>You can test our sample report including this feature in action <a target='blank' href='https://pureviz.net/infographic-sample-report'> here.</a></p>"
		    
		},	
		{
			"id": 20,
			"title": "Click & Hover Actions",
			"url": "#click-hover-actions",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>We can add click action to any layer so it will work like hyperlink based on dynamic http:// or https:// URL.</p><p>We can also add hover tooltip on any layer so we can show tips to end users with dynamic fields.  <img src='/infographic/docs/hovertooltip.gif'/> </p>"
		},
		{
			"id": 21,
			"title": "Advanced Formulas",
			"url": "#advanced-formulas",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>In third tab of conditional formatting pane, you can write free form formulas including <b>nested brackets and arithmetic operators</b>. It is also useful to use this tab for copy/paste operations between layers. </p> <img src='/infographic/docs/advancedformula.gif'/> <p><b>Example Math:</b><br>${math|[Discounts]/1000|2;,}K<br>Result: $2,135.25K</p><p><b>Example Date:</b><br>{date|[Date Column]|Mmm YYYY}<br>Result: Sep 2020</p><p><b>Example If:</b><br>{if|math|[Sales]|>|math|800|text|ABC|0;|text|XYZ|0;}<br>Result: ABC</p><p><br><b>Advanced Examples</b><br><br><b>Math:</b><br>Syntax: {math | [measure or formula] | decimals;thausandseparator}<br><br>Sample 1: {math | [Discounts] / 1000 | 2;, }<br>Result: 2,135.25<br><br>Sample 2: {math | [Discounts] / [Quantity] +10 | 1 }<br>Result: 125.7<br><br>Sample 3: ${math | [Discounts] / [Quantity] +10 | 1 }M<br>Result: $125.7M<br><br><br><b>Date:</b><br>Syntax: {date| [date measure] | formatstring }<br><br>Sample 1: {date|[Sales Date]|Mmm YYYY}<br>Result: Sep 2022<br><br>Sample 2: {date|[Ship Date]|D M YYYY}<br>Result: 1 9 2022<br><br><br><b>If Statements:</b><br>Syntax: { if | typeofcondition1 | [condition1] | operator | typeofcondition2 | [condition2] | typeofoutput1 | [output1] | [format1] | typeofoutput2 | [output2] | [format2] }<br><br>Basic Sample: If sales measure (which is a number) is greater than 800 then return ABC else return XYZ<br>Formula: {if|math|[Sales]|>|math|800|text|ABC|0|text|XYZ|0}<br>Result: ABC<br><br>Nested Sample: If sales measure (which is a number) is greater than 800 then return ABC else if Sales is greater than 400 then return DEF else return XYZ<br>Formula: {if|math|[Sales]|>|math|800|text|ABC|0;|text|{if|math|[Sales]|>|math|400|text|DEF|0;|text|XYZ|0;}|0;}<br>Result: 125.7<br><br>You can use nested formulas in if formulas using curly brackets. We are sorry (and have to accept) that formula syntax is a bit complicated, we have plans to improve readability of formulas in next releases. (Maybe support for generic DAX functions)<br><br>-----------------------<br><b>Aggregations and Filters:</b><br><br>On top of available functions, we recently added support for categories, which means that you can feed the visual with multiple row datasets. In order to access specific row in dataset or make aggregations we have basic data field manipulation syntax.<br><br>When you feed your visual with a table similar to below, you can read specific cell value using UI or write formulas similar to [Actual?Location=Asia]. This formula will search for the row with Location=Asia and will return first Actual value. Other operators and filters available in this syntax is shared below.<br><br>General Syntax: <br>[FieldName::Aggregation?Filter] <br>Aggregation parameter is optional and default value is “first“.<br><br>Sample Queries:<br>[Actual?Location=Asia] The first actual value from the table filtered with Location equals Asia.<br>[Actual::2?Location=Asia] The second actual value from the table filtered with Location equals Asia.<br>[Actual::last?Location=Asia] The last actual value from the table filtered with Location equals Asia.<br>[Actual::3] The third actual value from the table (sorted with default order of data defined in sort options of the visual).<br>[Actual::avg] Average of actual value from the table.<br>[Actual::sum?Location=Europe] Sum of actuals from the table filtered with Location equals Europe.<br></p>"
		},
		{
			"id": 99,
			"title": "<i class='fa fa-envelope-o'></i> Contact with Support",
			"url": "#support",
			"status": "active",
			"created": "2020-08-10 12:04:43",
			"modified": "2020-08-10 12:07:11",
			"tags": ["general","info"],
			"author": "PureViz Admin",
			"html": "<p>If you have any question regarding listed features or issues on PureViz Infographic Custom Visual, you can reach out to customer support directly via <b><a href='mailto:contact@pureviz.net'>contact@pureviz.net</a></b>. </p><p><br> If you think you faced with a bug, please include following information in your email: <br>-A clear description of what the bug is. <br>-Steps to reproduce the behavior.<br>-Sample report (.PBIX) that reproduces the issue.<br>-Screenshots for the issue. (Optional) </p>"
		}
		
	]

}

